# string = str("1 1 2 3 5 8 13 21 34 55")#Ввели в строку чила
# #Разделяем все значения в строке на подстрокии присваиваем их переменной
# list_of_string = string.split()
# #Объявляем переменную, создаем список
# #и при помощи  map подстрокам присваиваем значение числа.
# list_of_numbers = list(map(int, list_of_string))
# print(sum(list_of_numbers))
# print("")

#Задача 2.5.11

# title = input('Введите назвоние книги: ')
# author = input('Введите фамилию автора: ')
# year = input('Введите год выпуска книги: ')
# book = {
#     'title' : title,
#     'author' : author,
#     'year' : int(year)
# }
# print(book)
# a = input("Введите первую строку: ")
# b = input("Введите вторую строку: ")
#
# a_set, b_set = set(a), set(b) # используем множественное присваивание
#
# a_and_b = a_set.intersection(b_set)
#
# print(a_and_b)

print("")

# a = input("Введите числа через пробел: ").split()# Не забываем про split, разделяет стрку на подстроку.
# b = input("Введите числа через пробел: ").split()# Не забываем про split, разделяет стрку на подстроку.
# # print(type(string_2))
# # print(type(string_1))
# numb_1, numb_2 = set(a), set(b)
# numbers = numb_1.symmetric_difference(numb_2)
# print(list(numbers))
#
# print("")

