# B3.9. Break, Continue, Enumerate

# ENUMERATE

list_ = [-5, 2, 4, 8, 12, -7, 5]

for i in range(len(list_)): # rang присваивает каждому элементу индекс.
    print("Индекс элемента:", i)
    print("Значение элемента:", list_[i])
    print("---")
print("Конец цикла")

print("")

# Функия ENUMERATE - создает кортежи где на первом месте стоит индекс элемента, а на втором - его значение.

list_ = [-5, 2, 4, 8, 12, -7, 5]

for i, value in enumerate(list_):
    print("Индекс элемента:", i)
    print("Значение элемента:", value)
    print("---")
print("Конец цикла")

print("")

# ЦИКЛ FOR СО СТРОКАМИ И СЛОВАРЯМИ

# Задача

#Посчитаем количество вхождения каждого символа в заданном
# тексте с помощью словаря.

text = """
У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо -- песнь заводит,
Налево -- сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух... там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
"""
# Приведём текст в нижний регистр и удалим все пробелы и символы переноса строки.

text = text.lower() # Привели к нижнему ригистру.
text = text.replace(" ", "") # Убрали пробелы.
text = text.replace("/n", "") # Убрали символы перевода строки.

count = {} # заводим переменную счетчик для подсчета символов и их количества.
for letter in text:
    if letter in count: # Если символ уже встречался, то увеличиваем его кол-во на 1.
        count[letter] += 1
    else:
        count[letter] = 1
# items - метод у словаря, который возвращает кортежи состоящие из пар клю-значение.
# Зная из можно вывести статистику по тексту.
for char, cnt in count.items():
    print(f"Символ {char} встречается {cnt} раз")

print("")

text = """
У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо -- песнь заводит,
Налево -- сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух... там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
"""

text = text.lower() # Привели к нижнему ригистру.
text = text.replace("/n", "") # Убрали символы перевода строки.
text = text.split()

count = {}
for word in text:
    if word in count:
        count[word] += 1
    else:
        count[word] = 1
for char, cnt in count.items():
    print(f"Слово {char} встречается {cnt} раз")

print("")

# Break - преждевременно останавливает цикл и переходит к основному коду программы.

# Задача

# Проверим, является ли заданное число степенью числа «3».

# while True:
#     if n % 3 == 0: # Если остаток от деления на 3 будет равен 0.
#         n = n // 3
#         if n == 1:
#             break
#     else:
#         break

# CONTINUE - что-то типо break.

# Задача

# Условие: В клетке находятся фазаны и кролики. Известно, что у них 35 голов и 94 ноги. Узнайте число фазанов и число кроликов.

# Количество фазанов и кроликов выражается целым числом, поэтому будем
# перебирать все возможные комбинации количества кроликов и фазанов, и если их
# суммарное количество ног равно указанному в условии, то мы нашли одно из решений.

heads = 35
legs = 94

for r in range(heads + 1): # Кол-вл кроликов.
    for ph in range(heads + 1): # Кол-во фазанов.
#  если суммарное количество голов превышено или ног превышено, то переходим на следующий шаг цикла
        if (r + ph) > heads or \
                (r * 4 + ph * 2) > legs:
            continue
        if (r + ph) == heads and (r * 4 + ph * 2) == legs:
            print("Кол-во кроликов", r)
            print("Кол-во фазанов", ph)
            print("---")

print("")

list_ = [1,2,3,-1,3,2,1,2,3,2,1,0,0,0,-1,2]
#2
negate_index = -1
#3
negate_value = 0
#4
for i, val in enumerate(list_):
#5
   if val < 0:
       #6
       negate_index = i
       #7
       negate_value = val
       break
#9
print(f'{negate_index}: {negate_value}')

print("---")








