#Типы данных:Строки
s = "Hello"
#Извлекаем отдельные индексы
print(s[0])
print(s[4])
#Извлекаем подстроки
print(s[1:4])

print("")

#Срез
mystr = "Hellow world!"
print(mystr[::])#Идём от первого до последнего элемента с шагом 1.
print(mystr[2::])#Хотим начать со второго индекса.
print(mystr[::2])#Хотим пойти с шагом через 1.
print(mystr[-1])#Хотим начать от последнего элемента.
print(mystr[:-2])#Хотим вывести все элементы кроме двух последних.
print(mystr[::-1])#Хотим вывести элементы не с шагом 1, а в обратном порядке с шагом -1.

print("")

#ПОЛЕЗНЫЕ ФЦНКЦИИ
print("")
print(len(s))#Встроенная функция len() позволяет узнать длину строки.
#Метод find(substr), определенный для строк, позволяет находить символы и подстроки.
print("")
print(s.find('e'))#Возвращает индекс #1
print(s.find('o!'))#В случае подстроки возвращает индекс первого символа #4
print("")
#Функций позволяет определить, из чего состоит строкка.
print(s.isdigit())#Строка сотоит из цифр ?
print(s.isalpha())#Строка состит из букв ?
print(s.isalnum())#Строка состит из цифр и букв ?
print("")
#Позволяет привести все буквы к верхнему или нижнему регистру.
print(s.upper())
print(s.lower())
print