# B3.4. Практические примеры с условным оператором.
# Задача: Запишите условие проверки целого числа А: является ли оно кратным двум или трём?
# Запишем это:

# if A % 2 == 0:
#     print('Число А кратно 2')

# Аналогично условие будет выглядеть для кратности числа трём:

# if A % 3 == 0:
#     print('Число А кратно 3')

# Как теперь нам записать это в одно условие?

# if A % 2 == 0 or A  % 3 == 0:
#     print('Число А кратно 2 или 3')

one = 12
two = 30
print((one % 2 == 0) and (two % 2 ==0))

print("")

# Задача
# Давайте рассмотрим следующую задачу. Нам нужно написать программу, с помощью которой можно определить,
# является ли данное время суток утром, и вывести соответствующее сообщение.
# Утром считается временной промежуток с 6:00 (включительно) до 12:00 (не включительно).

# if hour >= 6 and hour < 12:
#     print("Утро!!!")

# То же самое условие, как мы знаем, можно записать более лаконичным способом:

# if 6 <= hour <12:
#     print("Утро!!!")

x = int(input("Введите значение X: "))
y = int(input("Введите значение Y: "))

if x > 0 and y > 0:
    print("Первая четверть ")
if x > 0 and y < 0:
    print("Четвертая четверть ")
if x < 0 and y > 0:
    print("Вторая четверть ")
if x < 0 and y < 0:
    print("Третья четверть ")

print("")

# КОНСТРУКЦИЯ IF-ELIF-ELSE
a = int(input("Введите число: "))
if a == 10:
    print(f'{a} равно 10')
elif a < 10:
    print(f'{a} меньше 10')
else:
    print(f'{a} больше 10')
print("")
# ИСПОЛЬЗОВАНИЕ ОПЕРАТОРА IF-ELIF-ELSE

# Задача
# Напишите программу, которая бы принимала на вход номер месяца,
# определяла сезон и выводила сообщение в зависимости от номера месяца:

mounth = int(input("Введите номер месяца: "))
if mounth in [3, 4, 5]:
    print("Весна")
elif mounth in [6, 7, 8]:
    print("Лето")
elif mounth in [9, 10, 11]:
    print("Осень")
elif mounth in [12, 1, 2]:
    print("Зима")

print("")

speed = int(input("Введите скорость ветра: "))
if speed <= 0:
    print("Error")
elif speed >= 1 and speed <= 4:
    print("weak")
elif speed >= 5 and speed <= 10:
    print("moderate")
elif speed >= 11 and speed <= 18:
    print("strong")
elif speed >= 19:
    print("hurricane")

print("")

# ТЕРНАРНЫЙ УСЛОВНЫЙ ОПЕРАТОР

a = 42
b = 41

if a > b:
    result = a
else:
    result = b
print(result)

# Перепишем код

result = a if a > b else b
print(result)

print("")

# (A >= 45 and B >= 45 and C < 45) or (A >= 45 and B < 45 and C >= 45) or(A < 45 and B >= 45 and C >= 45)
# (A < -10 or A > -1) and (A < 2 or A > 15)

# Задание 3.4.6
# Дано натуральное восьмизначное число. Выясните, является ли оно палиндромом
# (читается одинаково слева направо и справа налево).
# Если число является палиндромом, необходимо вывести на экран сообщение
# "Number - палиндром", если не является — "Number - не палиндром".

numbers = 121
string = str(numbers)

if string == string[::-1]:
    print("Numbers - палиндром")
else:
    print("Number - не палиндром")




























